_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_76 (Conv2D)           (None, 32, 32, 32)        896       
_________________________________________________________________
activation_59 (Activation)   (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_77 (Conv2D)           (None, 32, 32, 64)        18496     
_________________________________________________________________
activation_60 (Activation)   (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_78 (Conv2D)           (None, 16, 16, 128)       73856     
_________________________________________________________________
dropout_34 (Dropout)         (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_79 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_61 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_80 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_62 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_81 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
dropout_35 (Dropout)         (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_82 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
activation_63 (Activation)   (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_83 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
activation_64 (Activation)   (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_84 (Conv2D)           (None, 4, 4, 128)         147584    
_________________________________________________________________
dropout_36 (Dropout)         (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_85 (Conv2D)           (None, 4, 4, 128)         147584    
_________________________________________________________________
activation_65 (Activation)   (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_86 (Conv2D)           (None, 4, 4, 128)         147584    
_________________________________________________________________
activation_66 (Activation)   (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_87 (Conv2D)           (None, 2, 2, 128)         147584    
_________________________________________________________________
dropout_37 (Dropout)         (None, 2, 2, 128)         0         
_________________________________________________________________
flatten_6 (Flatten)          (None, 512)               0         
_________________________________________________________________
dense_17 (Dense)             (None, 128)               65664     
_________________________________________________________________
dropout_38 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_18 (Dense)             (None, 256)               33024     
_________________________________________________________________
dropout_39 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_19 (Dense)             (None, 10)                2570      
_________________________________________________________________
activation_67 (Activation)   (None, 10)                0         
=================================================================
Total params: 1,522,762
Trainable params: 1,522,762
Non-trainable params: 0
_________________________________________________________________
