_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_10 (Conv2D)           (None, 32, 32, 32)        896       
_________________________________________________________________
activation_8 (Activation)    (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_11 (Conv2D)           (None, 32, 32, 64)        18496     
_________________________________________________________________
activation_9 (Activation)    (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_12 (Conv2D)           (None, 16, 16, 128)       73856     
_________________________________________________________________
dropout_3 (Dropout)          (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_13 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_10 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_14 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_11 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_15 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
dropout_4 (Dropout)          (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_16 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
activation_12 (Activation)   (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_17 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
activation_13 (Activation)   (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_18 (Conv2D)           (None, 4, 4, 128)         147584    
_________________________________________________________________
dropout_5 (Dropout)          (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_19 (Conv2D)           (None, 4, 4, 128)         147584    
_________________________________________________________________
activation_14 (Activation)   (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_20 (Conv2D)           (None, 4, 4, 128)         16512     
_________________________________________________________________
activation_15 (Activation)   (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_21 (Conv2D)           (None, 4, 4, 10)          1290      
_________________________________________________________________
global_average_pooling2d_2 ( (None, 10)                0         
_________________________________________________________________
activation_16 (Activation)   (None, 10)                0         
=================================================================
Total params: 1,144,138
Trainable params: 1,144,138
Non-trainable params: 0
_________________________________________________________________
