_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_55 (Conv2D)           (None, 32, 32, 32)        896       
_________________________________________________________________
activation_43 (Activation)   (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_56 (Conv2D)           (None, 32, 32, 64)        18496     
_________________________________________________________________
activation_44 (Activation)   (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_57 (Conv2D)           (None, 16, 16, 128)       73856     
_________________________________________________________________
dropout_23 (Dropout)         (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_58 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_45 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_59 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_46 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_60 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
dropout_24 (Dropout)         (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_61 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
activation_47 (Activation)   (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_62 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
activation_48 (Activation)   (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_63 (Conv2D)           (None, 4, 4, 128)         147584    
_________________________________________________________________
dropout_25 (Dropout)         (None, 4, 4, 128)         0         
_________________________________________________________________
flatten_4 (Flatten)          (None, 2048)              0         
_________________________________________________________________
dense_11 (Dense)             (None, 128)               262272    
_________________________________________________________________
dropout_26 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_12 (Dense)             (None, 256)               33024     
_________________________________________________________________
dropout_27 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_13 (Dense)             (None, 10)                2570      
_________________________________________________________________
activation_49 (Activation)   (None, 10)                0         
=================================================================
Total params: 1,276,618
Trainable params: 1,276,618
Non-trainable params: 0
_________________________________________________________________
