_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_43 (Conv2D)           (None, 32, 32, 32)        896       
_________________________________________________________________
activation_33 (Activation)   (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_44 (Conv2D)           (None, 32, 32, 64)        18496     
_________________________________________________________________
activation_34 (Activation)   (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_45 (Conv2D)           (None, 16, 16, 128)       73856     
_________________________________________________________________
dropout_14 (Dropout)         (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_46 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_35 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_47 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_36 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_48 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
dropout_15 (Dropout)         (None, 8, 8, 128)         0         
_________________________________________________________________
flatten_2 (Flatten)          (None, 8192)              0         
_________________________________________________________________
dense_4 (Dense)              (None, 128)               1048704   
_________________________________________________________________
dropout_16 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_5 (Dense)              (None, 256)               33024     
_________________________________________________________________
dropout_17 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_6 (Dense)              (None, 10)                2570      
_________________________________________________________________
activation_37 (Activation)   (None, 10)                0         
=================================================================
Total params: 1,620,298
Trainable params: 1,620,298
Non-trainable params: 0
_________________________________________________________________
