_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_22 (Conv2D)           (None, 32, 32, 32)        896       
_________________________________________________________________
activation_17 (Activation)   (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_23 (Conv2D)           (None, 32, 32, 64)        18496     
_________________________________________________________________
activation_18 (Activation)   (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_24 (Conv2D)           (None, 16, 16, 128)       73856     
_________________________________________________________________
dropout_6 (Dropout)          (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_25 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_19 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_26 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_20 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_27 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
dropout_7 (Dropout)          (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_28 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
activation_21 (Activation)   (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_29 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
activation_22 (Activation)   (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_30 (Conv2D)           (None, 4, 4, 128)         147584    
_________________________________________________________________
dropout_8 (Dropout)          (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_31 (Conv2D)           (None, 4, 4, 128)         147584    
_________________________________________________________________
activation_23 (Activation)   (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_32 (Conv2D)           (None, 4, 4, 128)         147584    
_________________________________________________________________
activation_24 (Activation)   (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_33 (Conv2D)           (None, 2, 2, 128)         147584    
_________________________________________________________________
dropout_9 (Dropout)          (None, 2, 2, 128)         0         
_________________________________________________________________
conv2d_34 (Conv2D)           (None, 2, 2, 128)         147584    
_________________________________________________________________
activation_25 (Activation)   (None, 2, 2, 128)         0         
_________________________________________________________________
conv2d_35 (Conv2D)           (None, 2, 2, 128)         16512     
_________________________________________________________________
activation_26 (Activation)   (None, 2, 2, 128)         0         
_________________________________________________________________
conv2d_36 (Conv2D)           (None, 2, 2, 10)          1290      
_________________________________________________________________
global_average_pooling2d_3 ( (None, 10)                0         
_________________________________________________________________
activation_27 (Activation)   (None, 10)                0         
=================================================================
Total params: 1,586,890
Trainable params: 1,586,890
Non-trainable params: 0
_________________________________________________________________
