_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_49 (Conv2D)           (None, 32, 32, 32)        896       
_________________________________________________________________
activation_38 (Activation)   (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_50 (Conv2D)           (None, 32, 32, 64)        18496     
_________________________________________________________________
activation_39 (Activation)   (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_51 (Conv2D)           (None, 16, 16, 128)       73856     
_________________________________________________________________
dropout_18 (Dropout)         (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_52 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_40 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_53 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_41 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_54 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
dropout_19 (Dropout)         (None, 8, 8, 128)         0         
_________________________________________________________________
flatten_3 (Flatten)          (None, 8192)              0         
_________________________________________________________________
dense_7 (Dense)              (None, 128)               1048704   
_________________________________________________________________
dropout_20 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_8 (Dense)              (None, 256)               33024     
_________________________________________________________________
dropout_21 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_9 (Dense)              (None, 256)               65792     
_________________________________________________________________
dropout_22 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_10 (Dense)             (None, 10)                2570      
_________________________________________________________________
activation_42 (Activation)   (None, 10)                0         
=================================================================
Total params: 1,686,090
Trainable params: 1,686,090
Non-trainable params: 0
_________________________________________________________________
