_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_37 (Conv2D)           (None, 32, 32, 32)        896       
_________________________________________________________________
activation_28 (Activation)   (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_38 (Conv2D)           (None, 32, 32, 64)        18496     
_________________________________________________________________
activation_29 (Activation)   (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_39 (Conv2D)           (None, 16, 16, 128)       73856     
_________________________________________________________________
dropout_10 (Dropout)         (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_40 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_30 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_41 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_31 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_42 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
dropout_11 (Dropout)         (None, 8, 8, 128)         0         
_________________________________________________________________
flatten_1 (Flatten)          (None, 8192)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 64)                524352    
_________________________________________________________________
dropout_12 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_2 (Dense)              (None, 256)               16640     
_________________________________________________________________
dropout_13 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_3 (Dense)              (None, 10)                2570      
_________________________________________________________________
activation_32 (Activation)   (None, 10)                0         
=================================================================
Total params: 1,079,562
Trainable params: 1,079,562
Non-trainable params: 0
_________________________________________________________________
