_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_64 (Conv2D)           (None, 32, 32, 32)        896       
_________________________________________________________________
activation_50 (Activation)   (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_65 (Conv2D)           (None, 32, 32, 64)        18496     
_________________________________________________________________
activation_51 (Activation)   (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_66 (Conv2D)           (None, 16, 16, 128)       73856     
_________________________________________________________________
dropout_28 (Dropout)         (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_67 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_52 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_68 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_53 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_69 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
dropout_29 (Dropout)         (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_70 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
activation_54 (Activation)   (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_71 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
activation_55 (Activation)   (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_72 (Conv2D)           (None, 4, 4, 128)         147584    
_________________________________________________________________
dropout_30 (Dropout)         (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_73 (Conv2D)           (None, 4, 4, 128)         147584    
_________________________________________________________________
activation_56 (Activation)   (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_74 (Conv2D)           (None, 4, 4, 128)         147584    
_________________________________________________________________
activation_57 (Activation)   (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_75 (Conv2D)           (None, 2, 2, 128)         147584    
_________________________________________________________________
dropout_31 (Dropout)         (None, 2, 2, 128)         0         
_________________________________________________________________
flatten_5 (Flatten)          (None, 512)               0         
_________________________________________________________________
dense_14 (Dense)             (None, 64)                32832     
_________________________________________________________________
dropout_32 (Dropout)         (None, 64)                0         
_________________________________________________________________
dense_15 (Dense)             (None, 256)               16640     
_________________________________________________________________
dropout_33 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_16 (Dense)             (None, 10)                2570      
_________________________________________________________________
activation_58 (Activation)   (None, 10)                0         
=================================================================
Total params: 1,473,546
Trainable params: 1,473,546
Non-trainable params: 0
_________________________________________________________________
