_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d_88 (Conv2D)           (None, 32, 32, 32)        896       
_________________________________________________________________
activation_68 (Activation)   (None, 32, 32, 32)        0         
_________________________________________________________________
conv2d_89 (Conv2D)           (None, 32, 32, 64)        18496     
_________________________________________________________________
activation_69 (Activation)   (None, 32, 32, 64)        0         
_________________________________________________________________
conv2d_90 (Conv2D)           (None, 16, 16, 128)       73856     
_________________________________________________________________
dropout_40 (Dropout)         (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_91 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_70 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_92 (Conv2D)           (None, 16, 16, 128)       147584    
_________________________________________________________________
activation_71 (Activation)   (None, 16, 16, 128)       0         
_________________________________________________________________
conv2d_93 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
dropout_41 (Dropout)         (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_94 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
activation_72 (Activation)   (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_95 (Conv2D)           (None, 8, 8, 128)         147584    
_________________________________________________________________
activation_73 (Activation)   (None, 8, 8, 128)         0         
_________________________________________________________________
conv2d_96 (Conv2D)           (None, 4, 4, 128)         147584    
_________________________________________________________________
dropout_42 (Dropout)         (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_97 (Conv2D)           (None, 4, 4, 128)         147584    
_________________________________________________________________
activation_74 (Activation)   (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_98 (Conv2D)           (None, 4, 4, 128)         147584    
_________________________________________________________________
activation_75 (Activation)   (None, 4, 4, 128)         0         
_________________________________________________________________
conv2d_99 (Conv2D)           (None, 2, 2, 128)         147584    
_________________________________________________________________
dropout_43 (Dropout)         (None, 2, 2, 128)         0         
_________________________________________________________________
flatten_7 (Flatten)          (None, 512)               0         
_________________________________________________________________
dense_20 (Dense)             (None, 128)               65664     
_________________________________________________________________
dropout_44 (Dropout)         (None, 128)               0         
_________________________________________________________________
dense_21 (Dense)             (None, 256)               33024     
_________________________________________________________________
dropout_45 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_22 (Dense)             (None, 256)               65792     
_________________________________________________________________
dropout_46 (Dropout)         (None, 256)               0         
_________________________________________________________________
dense_23 (Dense)             (None, 10)                2570      
_________________________________________________________________
activation_76 (Activation)   (None, 10)                0         
=================================================================
Total params: 1,588,554
Trainable params: 1,588,554
Non-trainable params: 0
_________________________________________________________________
